In [7]:
import sqlite3
conn=sqlite3.connect("ecommerce.dat")
cur=conn.cursor()

In [31]:
#Customerstable:

cur.execute("Create table customers(customer_id INT primarykey,name varchar(20),username varchar(10),password varchar(10),address Text,phone_num INT)"
        )
cur.execute("Insert into customers values(100,'Anita','Anita_123','Anita@123','Dno:123,sunshine apartments, Hyderabad',9977998800)"
       )
cur.execute("Insert into customers values(101,'Bunty','Bun_123','Bun@123','Dno:456,Moonlight apartments, Hyderabad',9000089769)"
        )
cur.execute("Insert into customers values(102,'Cyathy','Cyat_123','Cyat@123','Dno:111,Divya apartments, Hyderabad',8897654321)"
        )
res=cur.execute("select * from customers")
res.fetchall()

[(100,
  'Anita',
  'Anita_123',
  'Anita@123',
  'Dno:123,sunshine apartments, Hyderabad',
  9977998800),
 (101,
  'Bunty',
  'Bun_123',
  'Bun@123',
  'Dno:456,Moonlight apartments, Hyderabad',
  9000089769),
 (102,
  'Cyathy',
  'Cyat_123',
  'Cyat@123',
  'Dno:111,Divya apartments, Hyderabad',
  8897654321)]

In [44]:
#Vendorstable
cur.execute("Create table vendors(vendor_id INT primarykey,store_name varchar(20),address Text,phone_num INT)")
cur.execute("Insert into vendors values(11,'Deepak_stores', 'Dno:123,sunshine apartments, Hyderabad',9977998800)"
       )
cur.execute("Insert into vendors values(12,'Fathima_stores', 'Dno:111,Divya apartments, Hyderabad',8897654321)"
      )
cur.execute("Alter table vendors add column customers_id INT References customers(customer_id)")

res=cur.execute("select * from vendors")
res.fetchall()

[(11,
  'Deepak_stores',
  'Dno:123,sunshine apartments, Hyderabad',
  9977998800,
  None),
 (12,
  'Fathima_stores',
  'Dno:111,Divya apartments, Hyderabad',
  8897654321,
  None)]

In [48]:
#to obtain relationship between vendor and customer, I made customers_id as foreignkey
cur.execute("update vendors set customers_id=100 where vendor_id=11")
cur.execute("update vendors set customers_id=102 where vendor_id=12")
res=cur.execute("select * from vendors")
res.fetchall()

[(11,
  'Deepak_stores',
  'Dno:123,sunshine apartments, Hyderabad',
  9977998800,
  100),
 (12,
  'Fathima_stores',
  'Dno:111,Divya apartments, Hyderabad',
  8897654321,
  102)]

In [13]:
conn.commit()

In [67]:
#Itemstable
cur.execute("Create table items(item_id INT primarykey,Item_name Text,Item_brand text,Quantity INT,Unit_price Real)"
        )
cur.execute("Insert into items values(1,'Laptop','HP',1500,25000)")
cur.execute("Insert into items values(2,'Laptop','Lenovo',1500,35000)")
cur.execute("Insert into items values(3,'Laptop','Dell',1000,15000)")
cur.execute("Insert into items values(4,'Mobile','Oneplus',100,35000)")
cur.execute("Insert into items values(5,'Mobile','Samsung',100,25000)")
res=cur.execute("select * from items")
res.fetchall()

[(1, 'Laptop', 'HP', 1500, 25000.0),
 (2, 'Laptop', 'Lenovo', 1500, 35000.0),
 (3, 'Laptop', 'Dell', 1000, 15000.0),
 (4, 'Mobile', 'Oneplus', 100, 35000.0),
 (5, 'Mobile', 'Samsung', 100, 25000.0)]

In [68]:
#Here obtained realtionship between vendors and items table ,foreign key is vendor id
cur.execute("Alter table items add column vendors_id INT References vendors(vendor_id)")
cur.execute("update items set vendors_id=11 where item_id=1")
cur.execute("update items set vendors_id=11 where item_id=2")
cur.execute("update items set vendors_id=11 where item_id=3")
cur.execute("update items set vendors_id=12 where item_id=4")
cur.execute("update items set vendors_id=12 where item_id=5")
res=cur.execute("select * from items")
res.fetchall()

[(1, 'Laptop', 'HP', 1500, 25000.0, 11),
 (2, 'Laptop', 'Lenovo', 1500, 35000.0, 11),
 (3, 'Laptop', 'Dell', 1000, 15000.0, 11),
 (4, 'Mobile', 'Oneplus', 100, 35000.0, 12),
 (5, 'Mobile', 'Samsung', 100, 25000.0, 12)]

In [78]:
#orderstable
cur.execute("Drop table orders")
cur.execute("Create table orders(order_id INT primarykey,Quantity_ordered INT,Tot_amount Real)"
        )
cur.execute("Insert into orders values(1001,2,30000)")
cur.execute("Insert into orders values(1002,1,25000)")

res=cur.execute("select * from orders")
res.fetchall()

[(1001, 2, 30000.0), (1002, 1, 25000.0)]

In [79]:
#here obtained relationship between orders, customers and iteam table, foreign keys customer_id and item_id
cur.execute("Alter table orders add column c_id INT References customers(customer_id)")
cur.execute("Alter table orders add column i_id INT References items(item_id)")
cur.execute("update orders set c_id=101 where order_id=1001")
cur.execute("update orders set c_id=101 where order_id=1002")
cur.execute("update orders set i_id=1 where order_id=1001")
cur.execute("update orders set i_id=4 where order_id=1002")
res=cur.execute("select * from orders")
res.fetchall()

[(1001, 2, 30000.0, 101, 1), (1002, 1, 25000.0, 101, 4)]

In [82]:
conn.commit()

In [7]:
#created a function to ease the insertion of customers

def registered_customer(customer_id,name,username,password ,address,phone_num):
    cur.execute("insert into customers values(?,?,?,?,?,?)",(customer_id,name,username,password ,address,phone_num))
    conn.commit()
    res=cur.execute("select * from customers")
    for i in res:
        print(i)

In [8]:
if __name__ == '__main__':
    registered_customer(103,'deepthy','deep_123','deep@123','Dno:159,kavya apartments, Hyderabad',8876543211)
    registered_customer(104,'elena','elena_123','elena@123','Dno:159,Lodha apartments, Hyderabad',9988774324)

(100, 'Anita', 'Anita_123', 'Anita@123', 'Dno:123,sunshine apartments, Hyderabad', 9977998800)
(101, 'Bunty', 'Bun_123', 'Bun@123', 'Dno:456,Moonlight apartments, Hyderabad', 9000089769)
(102, 'Cyathy', 'Cyat_123', 'Cyat@123', 'Dno:111,Divya apartments, Hyderabad', 8897654321)
(103, 'deepthy', 'deep_123', 'deep@123', 'Dno:159,kavya apartments, Hyderabad', 8876543211)
(100, 'Anita', 'Anita_123', 'Anita@123', 'Dno:123,sunshine apartments, Hyderabad', 9977998800)
(101, 'Bunty', 'Bun_123', 'Bun@123', 'Dno:456,Moonlight apartments, Hyderabad', 9000089769)
(102, 'Cyathy', 'Cyat_123', 'Cyat@123', 'Dno:111,Divya apartments, Hyderabad', 8897654321)
(103, 'deepthy', 'deep_123', 'deep@123', 'Dno:159,kavya apartments, Hyderabad', 8876543211)
(104, 'elena', 'elena_123', 'elena@123', 'Dno:159,Lodha apartments, Hyderabad', 9988774324)

In [13]:
#created a function to ease the insertion of vendors

def registered_vendor(vendor_id,store_name,address ,phone_num,customers_id):
    cur.execute("insert into vendors values(?,?,?,?,?)",(vendor_id,store_name,address ,phone_num,customers_id))
    conn.commit()
    res=cur.execute("select * from vendors")
    for i in res:
        print(i)

In [15]:
if __name__ == '__main__':
    registered_vendor(13,'zeus_stores', 'Dno:159,Lodha apartments, Hyderabad',8897654321,104)

(11, 'Deepak_stores', 'Dno:123,sunshine apartments, Hyderabad', 9977998800, 100)
(12, 'Fathima_stores', 'Dno:111,Divya apartments, Hyderabad', 8897654321, 102)
(12, 'zeus_stores', 'Dno:159,Lodha apartments, Hyderabad', 8897654321, 104)
(13, 'zeus_stores', 'Dno:159,Lodha apartments, Hyderabad', 8897654321, 104)

In [17]:
#performed dml and deleted input due to typo error
cur.execute("delete from vendors where vendor_id==12 and store_name=='zeus_stores'")

In [18]:
res=cur.execute("select * from vendors")
res.fetchall()

[(11,
  'Deepak_stores',
  'Dno:123,sunshine apartments, Hyderabad',
  9977998800,
  100),
 (12,
  'Fathima_stores',
  'Dno:111,Divya apartments, Hyderabad',
  8897654321,
  102),
 (13, 'zeus_stores', 'Dno:159,Lodha apartments, Hyderabad', 8897654321, 104)]

In [23]:
#created a function to ease the insertion of items
def registered_items(item_id,Item_name ,Item_brand,Quantity ,Unit_price ,vendors_id):
    cur.execute("insert into items values(?,?,?,?,?,?)",(item_id,Item_name ,Item_brand,Quantity ,Unit_price,vendors_id))
    conn.commit()
    res=cur.execute("select * from items")
    for i in res:
        print(i)

In [24]:
if __name__ == '__main__':
    registered_items(6,'Mouse','HP',50,900,13)

(1, 'Laptop', 'HP', 1500, 25000.0, 11)
(2, 'Laptop', 'Lenovo', 1500, 35000.0, 11)
(3, 'Laptop', 'Dell', 1000, 15000.0, 11)
(4, 'Mobile', 'Oneplus', 100, 35000.0, 12)
(5, 'Mobile', 'Samsung', 100, 25000.0, 12)
(6, 'Mouse', 'HP', 50, 900.0, 13)
(6, 'Mouse', 'HP', 50, 900.0, 13)

In [26]:
#created a function to ease the insertion of orders
def registered_orders(order_id,Quantity_ordered,Tot_amount,c_id,i_id):
    cur.execute("insert into orders values(?,?,?,?,?)",(order_id,Quantity_ordered,Tot_amount,c_id,i_id))
    conn.commit()
    res=cur.execute("select * from orders")
    for i in res:
        print(i)

In [27]:
if __name__ == '__main__':
    registered_orders(1003,1,900,104,6)

(1001, 2, 30000.0, 101, 1)
(1002, 1, 25000.0, 101, 4)
(1003, 1, 900.0, 104, 6)

In [54]:
#we can delete the unavailable items from the item table using this command subject to no availability
cur.execute("delete from items where item_id==6")
conn.commit()
res=cur.execute("select* from items")
for i in res:
    print(i)

In [31]:
conn.close()